# Требуется найти N число Фибоначчи
# def fib(number):
#     if number in [1, 2]:
#         return 2
#     return fib(number - 1) + fib(number - 2)
# print(fib(int(input('Введите порядковый номер последовательности: '))))

# Заменить максимальные оценки на минимальные
# from random import randint
# marks = []
# for _ in range(10):
#     marks.append(randint(2, 5))
# print(marks)
# for i in range(len(marks)):
#     if marks[i] == max(marks):
#         marks[i] = min(marks)
# print(marks)

# Напишите функцию, которая принимает одно число и проверяет
# является ли оно простым

# def simple_numb(number: int) -> bool:
#     if number%2 == 0 and number != 2:
#         return False
#     for i in range(3, number//2, 2):
#         if number%i == 0:
#             return False
#     return True
# print(simple_numb(int(input('Введите число: '))))

# Дано натурально число N и последовательность из N элементов
# Требуется вывести последовательность в обратном порядке








